#___________________МОДУЛЬ_3_ЧАСТЬ_1_УРОВЕНЬ1_НАЧАЛО____________________
# x = float(input('Введите сумму вклада: '))
# p = float(input('Введите ежегодную процентную ставку: '))
# y = float(input('Введите желаемую сумму дохода: '))
# p = p / 100
# total1 = 0
# i = x
# while i < y:
# 	i = int(i + x*p)
# 	total1 += 1
# print('Срок получения желаемой суммы(лет): ', total1)
#___________________МОДУЛЬ_3_ЧАСТЬ_1_УРОВЕНЬ1_КОНЕЦ_____________________

#___________________МОДУЛЬ_3_ЧАСТЬ_1_УРОВЕНЬ2_НАЧАЛО____________________
# n = int(input('Введите число повторений: '))
# i = 1
# while i <= n:
# 	print('for - частный случай цикла while')
# 	i += 1
#___________________МОДУЛЬ_3_ЧАСТЬ_1_УРОВЕНЬ2_КОНЕЦ_____________________

#___________________МОДУЛЬ_3_ЧАСТЬ_1_УРОВЕНЬ3_НАЧАЛО____________________
# def summa_cifr(num1):
# 	if num1 < 10:
# 		return num1
# 	else:
# 		return num1 % 10 + summa_cifr(num1 // 10)
# int1 = abs(int(input('Введите целое число, для расчета суммы цифр: ')))
# print('Сумма цифр целого числа равна: ', summa_cifr(int1))
#___________________МОДУЛЬ_3_ЧАСТЬ_1_УРОВЕНЬ3_КОНЕЦ_____________________